{
  "title": " Web accessibility. What every Front-end developer and designer should know.",
  "thumbnail": "/img/accecebility.jpg",
  "date": "2019-12-15T16:58:41.429Z",
  "description": "The topic of web accessibility is constantly drawing my attention. As a front-end developer, I've always been curious about how to make the interface as simple and straightforward as possible. I remember, as a student, I added event listeners to keyboard shortcuts to make it easier and faster to navigate my first web pages. So the scope of accessibility echoed within me when I found out what the concept meant. In this article I want to collect documents and briefly describe what accessibility is, why and to whom it is needed, as well as share my approach to developing and testing available interfaces. The material will be useful for both Front-end developers and designers, as well as anyone who uses the Internet.",
  "body": "Written by [_Vitaliy Stanyshevskyy_](https://dou.ua/users/vitaliy-stanyshevskyy/)__\n\nThe topic of web accessibility is constantly drawing my attention. As a front-end developer, I've always been curious about how to make the interface as simple and straightforward as possible. I remember, as a student, I added event listeners to keyboard shortcuts to make it easier and faster to navigate my first web pages. So the scope of accessibility echoed within me when I found out what the concept meant. In this article I want to collect documents and briefly describe what accessibility is, why and to whom it is needed, as well as share my approach to developing and testing available interfaces. The material will be useful for both Front-end developers and designers, as well as anyone who uses the Internet.\n\nFor me, the history of web accessibility began six years ago. Due to my inattention, I almost got into the wheels of the bus just 50 meters from the office where I worked at the time. Now I understand that this event has changed my life and attitude to ordinary things. After getting to my workplace and finally recovering, I thought about what my life would be like if I had made a step more or left home a second earlier. What would it be like for me to have a disability if I survived at all? How would I do the usual things? How would you make a living? Would that be the end? But remembering Stephen Hawking, who had been paralyzed most of my life, I decided to explore how people with disabilities use computers and the Internet.\n\nSo I discovered a new world of assistive technologies and approaches to designing interfaces that I want to talk about.\n\n## Assistive technologies\n\n![Bluetooth-switcher](/img/image16_wmql5hf.jpg \"Bluetooth-switcher\")\n\nWhen I realized that I could effectively interact with electronic devices without a screen or a mouse, my world turned. After all, I didn't even know about the variety of software and I / O devices other than the standard monitor, keyboard, and mouse. Here are just a few:\n\n**Screen readers** are the most common technology that is associated with web accessibility. Converts text from screen to synthesized audio stream or set of sounds of different frequency. In addition, screensavers allow you to quickly list items (titles, links, buttons, sections, etc.) and navigate between them, which greatly simplifies life. The most popular screensavers are VoiceOver (macOS, iOS), NVDA (Windows), Google TalkBack (Android).\n\n**A Braille display** is a device that converts visual information into a set of six-point characters that can be distinguished at the touch of a finger. It requires special software to display the information.\n\n**Speech recognition** and voice control. You don't surprise anyone now, everyone knows \"Ok, Google\" and \"Hey, Siri\". However, for people with impaired musculoskeletal, the voice recognition device will always remain relevant, especially now that the recognition quality is extremely high. Apple's report shows how important speech recognition is.\n\n**Switchers** are one or more large buttons in the same housing that the user can assign to different actions, such as scrolling or selecting an item. It is also used by people with musculoskeletal disorders.\n\n**Sip-and-puff** (SNP), inhale-exhale device - a device in the form of a tube that responds and transmits information in response to inhalation and exhalation. The force of the air flow and its direction changes the direction of the cursor on the screen.\n\nOf all the above technologies, screen readers are the most common and affordable. They should be tried by everyone for a new experience. For a while, I used the screen reader everywhere: on the resources I visited daily and on the pages I created. And it was difficult to navigate my pages. I also decided to collect statistics to better understand the demand for web accessibility.\n\n## Accessibility is not just about illness\n\n![Accessibility](/img/image5_jugc7z4.png \"Accessibility\")\n\nLooking for statistics in English sources, I constantly came across terms of impairment and disability.\n\nImpairment - temporary or permanent loss of function or abnormal functioning of organs and systems of the body. Simply put, these are symptoms and signs that something went wrong with our body.\n\nDisability - the restriction or inability of a person to perform habitual actions during the usual time for the average person. Failure is the result of damage."
}